app/controllers/accounts_controller.rb

  def create
    @account = Account.new(params[:account])

    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("active", "created_at", "date", "init_balance", "name", "note", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)