app/controllers/merchants_controller.rb

SELECT "merchants".* FROM "merchants"
---
  def index
    @merchants = Merchant.all

SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @merchant = Merchant.find(params[:id])

INSERT INTO "merchants" ("address", "contact", "created_at", "name", "note", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @merchant = Merchant.new(params[:merchant])

    respond_to do |format|
      if @merchant.save