app/controllers/shoppings_controller.rb

  def index
    @shoppings = Shopping.all
---
SELECT "shoppings".* FROM "shoppings"

  def show
    @shopping = Shopping.find(params[:id])
---
SELECT "shoppings".* FROM "shoppings" WHERE "shoppings"."id" = ? LIMIT 1  [["id", "1"]]

  def create

    @shopping = Shopping.new(params[:shopping])

    respond_to do |format|
      if @shopping.save
---
INSERT INTO "shoppings" ("account_id", "amount", "bill_number", "created_at", "date", "merchant_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)