app/controllers/transfers_controller.rb

SELECT "transfers".* FROM "transfers"
---
  def index
    @transfers = Transfer.all

SELECT "transfers".* FROM "transfers" WHERE "transfers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @transfer = Transfer.find(params[:id])

INSERT INTO "transfers" ("amount", "created_at", "date", "from_account_id", "note", "to_account_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @transfer = Transfer.new(params[:transfer])

    respond_to do |format|
      if @transfer.save

SELECT "transfers".* FROM "transfers" WHERE "transfers"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "transfers" WHERE "transfers"."id" = ?  [["id", 1]]
---
  def destroy
    @transfer = Transfer.find(params[:id])
    @transfer.destroy