app/controllers/units_controller.rb

SELECT "units".* FROM "units"
---
  def index
    @units = Unit.all

SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @unit = Unit.find(params[:id])

SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @unit = Unit.find(params[:id])

INSERT INTO "units" ("active", "created_at", "name", "note", "symbol", "unit_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @unit = Unit.new(params[:unit])

    respond_to do |format|
      if @unit.save

SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "units" SET "name" = 'Gram', "updated_at" = '2014-01-30 10:51:53.153557' WHERE "units"."id" = 2
---
  def update
    @unit = Unit.find(params[:id])

    respond_to do |format|
      if @unit.update_attributes(params[:unit])