app/views/transfers/_form.html.erb

    <!-- <%= f.number_field :from_account_id %> -->
    <%= f.select 'from_account_id', Account.all.collect {|p| [ p.name, p.id ] } %>
---
SELECT "accounts".* FROM "accounts"