app/views/categories/_form.html.erb

    <%= f.label :parent_id %><br />
    <%= f.select 'parent_id', Category.all.collect {|p| [ p.name, p.id ] } %>
---
SELECT "categories".* FROM "categories"