app/views/shoppings/_form.html.erb

SELECT "accounts".* FROM "accounts"
---
    <%= f.label :account_id %><br />
    <%= f.select 'account_id', Account.all.collect {|p| [ p.name, p.id ] } %>

SELECT "units".* FROM "units"
---
            <td>
              <%= p.select 'unit_id', Unit.all.collect {|p| [ p.name, p.id ] } %>

SELECT "categories".* FROM "categories"
---
            <td>
              <%= p.select 'category_id', Category.all.collect {|p| [ p.name, p.id ] } %>

SELECT "merchants".* FROM "merchants"
---
    <%= f.label :merchant_id %><br />
    <%= f.select 'merchant_id', Merchant.all.collect {|p| [ p.name, p.id ] } %>