app/views/products/_form.html.erb

SELECT "units".* FROM "units"
---
    <%= f.label :unit_id %><br />
    <%= f.select 'unit_id', Unit.all.collect {|p| [ p.name, p.id ] } %>

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id %><br />
    <%= f.select 'category_id', Category.all.collect {|p| [ p.name, p.id ] } %>